# 程序控制结构
# 1. 顺序结构
# 2. 分支结构
# 3. 循环结构

# 1.单分支结构
# 语法：
# if 条件:
#     代码块
#
# 2.双分支结构
# 语法：
# if 条件:
#     代码块
# else:
#     代码块
#
# 3.多分支结构
# 语法：
# if 条件:
#     代码块
# elif 条件:
#     代码块
# else:
#     代码块

# 4. 嵌套分支结构
# 语法：
# if 条件:
#     代码块
#     if 条件:
#         代码块
#     else:
#         代码块
# else:
#     代码块

# 5. for循环结构
# 语法：
# for 变量 in 序列:
#     代码块
#

# for可以与else搭配使用，当for循环正常执行完，没有被break中断，则执行else语句
# 语法：
# for 变量 in 序列:
#     代码块
# else:
#     代码块

# 6. while循环结构
# 语法：
# while 条件:
#     代码块

# while可以与else搭配使用，当while循环正常执行完，没有被break中断，则执行else语句
# 语法：
# while 条件:
#     代码块
# else:
#     代码块

# 7. 多重循环结构
# 语法：
# for 变量 in 序列:
#     for 变量 in 序列:
#         代码块
#
# eg:打印金字塔
